* Recipes to print barcode labels using [[http://www.reportlab.com/software/opensource/][reportlab]] 

I am a little amazed that I can't find a simple database of label metrics to
make PDFs for printing. That is Avery, Herma, etc. make and sell blank label
forms, for which a PDF can be created in order to print onto the blank label
forms. How do people do inventory managment with open source software?

My needs are minimal but hopefully someone will tell me where to find
all of these metrics or that someone has a similar open source software
package. For now, I will publish this poor code.

** Install

#+BEGIN_SRC shell
pip install git+https://github.com/oneyb/makebarcode
# Or:
git clone https://github.com/oneyb/makebarcode
cd makebarcode && python setup.py install
#+END_SRC

*NOTE*: you will need to install it as root or as your user (--user), in order to have the following scripts in the system path.

* Usage
For now, I use this simple python module as following.
*WARNING*: The command accepts python code and executes it. This has plenty of security implications, so use it with caution.
#+BEGIN_SRC shell
create_page_of_barcodes.py --codes '["Box{:=04}".format(i) for i in range(n_labels_x * n_labels_y + 1)[1:]]' \
       --encoder Code128 --recipe avery_3475 --filename barcodes.pdf
#+END_SRC
A lá:
#+BEGIN_QUOTE
UNIX was not designed to stop its users from doing stupid things, as that would also stop them from doing clever things.   -- unknown (generally attributed to a Doug Gwyn, but no information found about him)
#+END_QUOTE

For single encodings:
#+BEGIN_SRC shell
create_single_barcode.py -c 'universal answer 42' -x 5 -y 3
#+END_SRC

List available =recipes=:
#+BEGIN_SRC shell :results verbatim
create_page_of_barcodes.py --list-recipes
#+END_SRC

#+RESULTS:
#+begin_example

Described recipes are:

	avery_L7120
	herma_4474
	avery_3475


	Would you like to contribute metrics for a certain label paper?
	Please do so at:
	https://github.com/oneyb/reportlab-barcode-recipes
#+end_example


List available =encoders=:
#+BEGIN_SRC shell :results verbatim
create_page_of_barcodes.py -le
#+END_SRC

#+RESULTS:
#+begin_example

Accepted encoders are:

	Codabar
	Code11
	Code128
	Code128Auto
	EAN13
	EAN5
	EAN8
	ECC200DataMatrix
	Extended39
	Extended93
	FIM
	I2of5
	ISBN
	MSI
	POSTNET
	QR
	Standard39
	Standard93
	UPCA
	USPS_4State

#+end_example

# * TODO Implement the following functionality:
#   - [X] better positioning of text below =code=
#   - [X] different paper sizes than A4, which depend on [[file:recipe_database.py][recipe]] 
#   - [X] Complete command line options
#   - [X] implement =python= scripting capabilities/make package
#   - [ ] Allow linking to inventory to rely on pool
#   - [ ] page barcode sequences for traceability work
#     - [ ] filter process inventory
#     - [ ] split up processes per room
#     - [ ] add barcodes for problems
#     - [ ] Add header with info, logo, and versioning
#     - [ ] add watermark
#   - [ ] devise and implement tests
#     - [ ] implement cosmetic test idea: output pdf, convert to image, compare raw image data
#   - [ ] Different output formats for single barcode script


* Future

This project has been discontinued. I may pick it up given any future needs.
Please fork this repository, if you find it useful. It is a worthy project in
my opinion and would definitely be an important building block for a simple
inventory system at home or elsewhere.
 
